clc;clear
%%
%说明：
%选择仿真例题号后，将对应题目的待观察变量后的";"去掉，运行即可得到命令行窗口的输出
%%
%请输入仿真例题号：
number = 2;
%%
switch number
    case 1  
        %%(1)
        syms t
        A = [0 1 0; 0 0 1; 2 -5 4];
        B = [0; 0; 0];
        C = [1 0 0];
        D = [0];
        eAt = expm(A * t);
        eAt = simplify(eAt)
        %%(2)
        x0 = [1; 1; 1];    % 手动设定一个状态
        initial(A, B, C, D, x0);
        %%(3)
        B = [1; 0; 0];
        step(A, B, C, D, x0);
    case 2
        %%(1)
        A = [1 -2 2; -2 -2 4;2 4 -2];
        B = [1 0; 0 1; 1 1];
        C = [1 2 1; 0 -1 2];
        D = [0 0;0 0];
        x0 = [1; 2; 3];    % 手动设定一个状态
        initial(A, B, C, D, x0);
        %%(2)
    case 3
        %%(1)
        syms T;
        A = [0 1 0;0 0 1;2 -5 4];
        B = [1;0;0];
        [G, H] = c2d(A, B, T);
        %%(2)
        T = 0.1;
        [G, H] = c2d(A, B, T);
        %%(3)    
end